Ran Plan for dir: `.` workspace: `default`

<details><summary>Show Output</summary>

```diff

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create

Terraform will perform the following actions:

  # module.vpc_network[0].google_compute_firewall.allow-icmp will be created
+ resource "google_compute_firewall" "allow-icmp" {
      + creation_timestamp = (known after apply)
      + destination_ranges = (known after apply)
      + direction          = "INGRESS"
      + enable_logging     = (known after apply)
      + id                 = (known after apply)
      + name               = (known after apply)
      + network            = (known after apply)
      + priority           = 1000
      + project            = "sunlit-cab-463104-m6"
      + self_link          = (known after apply)
      + source_ranges      = [
          + "14.97.94.230/32",
        ]

      + allow {
          + ports    = []
          + protocol = "icmp"
        }
    }

  # module.vpc_network[0].google_compute_network.auto-vpc-tf-unique-names will be created
+ resource "google_compute_network" "auto-vpc-tf-unique-names" {
      + auto_create_subnetworks                   = true
      + bgp_always_compare_med                    = (known after apply)
      + bgp_best_path_selection_mode              = (known after apply)
      + bgp_inter_region_cost                     = (known after apply)
      + delete_default_routes_on_create           = false
      + gateway_ipv4                              = (known after apply)
      + id                                        = (known after apply)
      + internal_ipv6_range                       = (known after apply)
      + mtu                                       = (known after apply)
      + name                                      = (known after apply)
      + network_firewall_policy_enforcement_order = "AFTER_CLASSIC_FIREWALL"
      + network_id                                = (known after apply)
      + numeric_id                                = (known after apply)
      + project                                   = "sunlit-cab-463104-m6"
      + routing_mode                              = (known after apply)
      + self_link                                 = (known after apply)
    }

  # module.vpc_network[0].google_compute_network.custom-vpc-tf-uniques will be created
+ resource "google_compute_network" "custom-vpc-tf-uniques" {
      + auto_create_subnetworks                   = false
      + bgp_always_compare_med                    = (known after apply)
      + bgp_best_path_selection_mode              = (known after apply)
      + bgp_inter_region_cost                     = (known after apply)
      + delete_default_routes_on_create           = false
      + gateway_ipv4                              = (known after apply)
      + id                                        = (known after apply)
      + internal_ipv6_range                       = (known after apply)
      + mtu                                       = (known after apply)
      + name                                      = (known after apply)
      + network_firewall_policy_enforcement_order = "AFTER_CLASSIC_FIREWALL"
      + network_id                                = (known after apply)
      + numeric_id                                = (known after apply)
      + project                                   = "sunlit-cab-463104-m6"
      + routing_mode                              = (known after apply)
      + self_link                                 = (known after apply)
    }

  # module.vpc_network[0].google_compute_subnetwork.subnet-custom-vpc-tfv will be created
+ resource "google_compute_subnetwork" "subnet-custom-vpc-tfv" {
      + creation_timestamp         = (known after apply)
      + enable_flow_logs           = (known after apply)
      + external_ipv6_prefix       = (known after apply)
      + fingerprint                = (known after apply)
      + gateway_address            = (known after apply)
      + id                         = (known after apply)
      + internal_ipv6_prefix       = (known after apply)
      + ip_cidr_range              = "10.1.0.0/24"
      + ipv6_cidr_range            = (known after apply)
      + ipv6_gce_endpoint          = (known after apply)
      + name                       = (known after apply)
      + network                    = (known after apply)
      + private_ip_google_access   = true
      + private_ipv6_google_access = (known after apply)
      + project                    = "sunlit-cab-463104-m6"
      + purpose                    = (known after apply)
      + region                     = "us-central1"
      + self_link                  = (known after apply)
      + stack_type                 = (known after apply)
      + state                      = (known after apply)
      + subnetwork_id              = (known after apply)

      + secondary_ip_range {
          + ip_cidr_range           = (known after apply)
          + range_name              = (known after apply)
          + reserved_internal_range = (known after apply)
        }
    }

  # module.vpc_network[0].random_id.suffix will be created
+ resource "random_id" "suffix" {
      + b64_std     = (known after apply)
      + b64_url     = (known after apply)
      + byte_length = 4
      + dec         = (known after apply)
      + hex         = (known after apply)
      + id          = (known after apply)
    }

  # module.vpc_network[1].google_compute_firewall.allow-icmp will be created
+ resource "google_compute_firewall" "allow-icmp" {
      + creation_timestamp = (known after apply)
      + destination_ranges = (known after apply)
      + direction          = "INGRESS"
      + enable_logging     = (known after apply)
      + id                 = (known after apply)
      + name               = (known after apply)
      + network            = (known after apply)
      + priority           = 1000
      + project            = "sunlit-cab-463104-m6"
      + self_link          = (known after apply)
      + source_ranges      = [
          + "14.97.94.230/32",
        ]

      + allow {
          + ports    = []
          + protocol = "icmp"
        }
    }

  # module.vpc_network[1].google_compute_network.auto-vpc-tf-unique-names will be created
+ resource "google_compute_network" "auto-vpc-tf-unique-names" {
      + auto_create_subnetworks                   = true
      + bgp_always_compare_med                    = (known after apply)
      + bgp_best_path_selection_mode              = (known after apply)
      + bgp_inter_region_cost                     = (known after apply)
      + delete_default_routes_on_create           = false
      + gateway_ipv4                              = (known after apply)
      + id                                        = (known after apply)
      + internal_ipv6_range                       = (known after apply)
      + mtu                                       = (known after apply)
      + name                                      = (known after apply)
      + network_firewall_policy_enforcement_order = "AFTER_CLASSIC_FIREWALL"
      + network_id                                = (known after apply)
      + numeric_id                                = (known after apply)
      + project                                   = "sunlit-cab-463104-m6"
      + routing_mode                              = (known after apply)
      + self_link                                 = (known after apply)
    }

  # module.vpc_network[1].google_compute_network.custom-vpc-tf-uniques will be created
+ resource "google_compute_network" "custom-vpc-tf-uniques" {
      + auto_create_subnetworks                   = false
      + bgp_always_compare_med                    = (known after apply)
      + bgp_best_path_selection_mode              = (known after apply)
      + bgp_inter_region_cost                     = (known after apply)
      + delete_default_routes_on_create           = false
      + gateway_ipv4                              = (known after apply)
      + id                                        = (known after apply)
      + internal_ipv6_range                       = (known after apply)
      + mtu                                       = (known after apply)
      + name                                      = (known after apply)
      + network_firewall_policy_enforcement_order = "AFTER_CLASSIC_FIREWALL"
      + network_id                                = (known after apply)
      + numeric_id                                = (known after apply)
      + project                                   = "sunlit-cab-463104-m6"
      + routing_mode                              = (known after apply)
      + self_link                                 = (known after apply)
    }

  # module.vpc_network[1].google_compute_subnetwork.subnet-custom-vpc-tfv will be created
+ resource "google_compute_subnetwork" "subnet-custom-vpc-tfv" {
      + creation_timestamp         = (known after apply)
      + enable_flow_logs           = (known after apply)
      + external_ipv6_prefix       = (known after apply)
      + fingerprint                = (known after apply)
      + gateway_address            = (known after apply)
      + id                         = (known after apply)
      + internal_ipv6_prefix       = (known after apply)
      + ip_cidr_range              = "10.1.0.0/24"
      + ipv6_cidr_range            = (known after apply)
      + ipv6_gce_endpoint          = (known after apply)
      + name                       = (known after apply)
      + network                    = (known after apply)
      + private_ip_google_access   = true
      + private_ipv6_google_access = (known after apply)
      + project                    = "sunlit-cab-463104-m6"
      + purpose                    = (known after apply)
      + region                     = "us-central1"
      + self_link                  = (known after apply)
      + stack_type                 = (known after apply)
      + state                      = (known after apply)
      + subnetwork_id              = (known after apply)

      + secondary_ip_range {
          + ip_cidr_range           = (known after apply)
          + range_name              = (known after apply)
          + reserved_internal_range = (known after apply)
        }
    }

  # module.vpc_network[1].random_id.suffix will be created
+ resource "random_id" "suffix" {
      + b64_std     = (known after apply)
      + b64_url     = (known after apply)
      + byte_length = 4
      + dec         = (known after apply)
      + hex         = (known after apply)
      + id          = (known after apply)
    }

  # module.vpc_network[2].google_compute_firewall.allow-icmp will be created
+ resource "google_compute_firewall" "allow-icmp" {
      + creation_timestamp = (known after apply)
      + destination_ranges = (known after apply)
      + direction          = "INGRESS"
      + enable_logging     = (known after apply)
      + id                 = (known after apply)
      + name               = (known after apply)
      + network            = (known after apply)
      + priority           = 1000
      + project            = "sunlit-cab-463104-m6"
      + self_link          = (known after apply)
      + source_ranges      = [
          + "14.97.94.230/32",
        ]

      + allow {
          + ports    = []
          + protocol = "icmp"
        }
    }

  # module.vpc_network[2].google_compute_network.auto-vpc-tf-unique-names will be created
+ resource "google_compute_network" "auto-vpc-tf-unique-names" {
      + auto_create_subnetworks                   = true
      + bgp_always_compare_med                    = (known after apply)
      + bgp_best_path_selection_mode              = (known after apply)
      + bgp_inter_region_cost                     = (known after apply)
      + delete_default_routes_on_create           = false
      + gateway_ipv4                              = (known after apply)
      + id                                        = (known after apply)
      + internal_ipv6_range                       = (known after apply)
      + mtu                                       = (known after apply)
      + name                                      = (known after apply)
      + network_firewall_policy_enforcement_order = "AFTER_CLASSIC_FIREWALL"
      + network_id                                = (known after apply)
      + numeric_id                                = (known after apply)
      + project                                   = "sunlit-cab-463104-m6"
      + routing_mode                              = (known after apply)
      + self_link                                 = (known after apply)
    }

  # module.vpc_network[2].google_compute_network.custom-vpc-tf-uniques will be created
+ resource "google_compute_network" "custom-vpc-tf-uniques" {
      + auto_create_subnetworks                   = false
      + bgp_always_compare_med                    = (known after apply)
      + bgp_best_path_selection_mode              = (known after apply)
      + bgp_inter_region_cost                     = (known after apply)
      + delete_default_routes_on_create           = false
      + gateway_ipv4                              = (known after apply)
      + id                                        = (known after apply)
      + internal_ipv6_range                       = (known after apply)
      + mtu                                       = (known after apply)
      + name                                      = (known after apply)
      + network_firewall_policy_enforcement_order = "AFTER_CLASSIC_FIREWALL"
      + network_id                                = (known after apply)
      + numeric_id                                = (known after apply)
      + project                                   = "sunlit-cab-463104-m6"
      + routing_mode                              = (known after apply)
      + self_link                                 = (known after apply)
    }

  # module.vpc_network[2].google_compute_subnetwork.subnet-custom-vpc-tfv will be created
+ resource "google_compute_subnetwork" "subnet-custom-vpc-tfv" {
      + creation_timestamp         = (known after apply)
      + enable_flow_logs           = (known after apply)
      + external_ipv6_prefix       = (known after apply)
      + fingerprint                = (known after apply)
      + gateway_address            = (known after apply)
      + id                         = (known after apply)
      + internal_ipv6_prefix       = (known after apply)
      + ip_cidr_range              = "10.1.0.0/24"
      + ipv6_cidr_range            = (known after apply)
      + ipv6_gce_endpoint          = (known after apply)
      + name                       = (known after apply)
      + network                    = (known after apply)
      + private_ip_google_access   = true
      + private_ipv6_google_access = (known after apply)
      + project                    = "sunlit-cab-463104-m6"
      + purpose                    = (known after apply)
      + region                     = "us-central1"
      + self_link                  = (known after apply)
      + stack_type                 = (known after apply)
      + state                      = (known after apply)
      + subnetwork_id              = (known after apply)

      + secondary_ip_range {
          + ip_cidr_range           = (known after apply)
          + range_name              = (known after apply)
          + reserved_internal_range = (known after apply)
        }
    }

  # module.vpc_network[2].random_id.suffix will be created
+ resource "random_id" "suffix" {
      + b64_std     = (known after apply)
      + b64_url     = (known after apply)
      + byte_length = 4
      + dec         = (known after apply)
      + hex         = (known after apply)
      + id          = (known after apply)
    }

Plan: 15 to add, 0 to change, 0 to destroy.

Warning: Provider google is undefined

  on main.tf line 19, in module "vpc_network":
  19:     google = google.project

Module module.vpc_network does not declare a provider named google.
If you wish to specify a provider configuration for the module, add an entry
for google in the required_providers block within the module.

(and 3 more similar warnings elsewhere)

Warning: Empty provider configuration blocks are not required

  on modules/buckets/main.tf line 8:
   8: provider "google" {

Remove the google.project provider block from module.buckets. Add
google.project to the list of configuration_aliases for google in
required_providers to define the provider configuration name.

(and 3 more similar warnings elsewhere)

```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -d .`
* :put_litter_in_its_place: To **delete** this plan click [here](http://0e9ec8217d70:4141/lock?id=Sandeep13Paul%252Fterraform_modules%252F.%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -d .`
</details>
Plan: 15 to add, 0 to change, 0 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
* :put_litter_in_its_place: To delete all plans and locks for the PR, comment:
    * `atlantis unlock`
